In [1]:
from pathlib import Path
import os
import pandas as pd

In [2]:
clean_data_folder = Path('../../clean_data')
os.listdir(clean_data_folder)

['12.baoluu.parquet',
 'diem_Thu.parquet',
 'sinhvien_dtb_toankhoa.parquet',
 'uit_hocphi_miengiam.parquet',
 'diemrl.parquet',
 'sinhvien_dtb_hocky.parquet',
 'desktop.ini',
 '14.totnghiep.parquet',
 '1.sinhvien.xlsx',
 '2.diem.xlsx',
 '3.sinhvien_chungchi.xlsx',
 '4.xeploaiav.xlsx',
 '5.Thisinh.xlsx',
 '6.giayxacnhan.xlsx',
 '8.XLHV.xlsx',
 '10.diemrl.xlsx',
 'enriched_dtb_hk.parquet',
 'desktop.ini']

In [3]:
data_folder = Path('../../Education_dataset_V2')
os.listdir(data_folder)

['sinhvien_dtb_hocky.xlsx',
 'diem_Thu.xlsx',
 'Education_dataset_V2.rar',
 'sinhvien_dtb_toankhoa.xlsx',
 'uit_hocphi_miengiam.xlsx',
 '12.baoluu.xlsx',
 '14.totnghiep.xlsx',
 'diemrl.xlsx',
 '08.XLHV.xlsx',
 '05.ThiSinh.xlsx',
 '00.ghichu.txt',
 '03.sinhvien_chungchi.xlsx',
 '00_dhcntt-dtdh_19-01-2016_scan.pdf',
 '04.xeploaiav.xlsx',
 '10.diemrl.xlsx',
 '06.giayxacnhan.xlsx',
 '02.diem.xlsx',
 '01.sinhvien.xlsx',
 'desktop.ini']

# 02.diem

In [4]:
diem_df = pd.read_excel(data_folder/'02.diem.xlsx')

In [5]:
diem_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99099 entries, 0 to 99098
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          20000 non-null  float64
 1   mssv        98963 non-null  object
 2    mamh       98963 non-null  object
 3    malop      98963 non-null  object
 4    sotc       98963 non-null  float64
 5    namhoc     98963 non-null  float64
 6    hocky      98963 non-null  float64
 7    diem       98928 non-null  float64
 8    trangthai  98963 non-null  float64
 9    mamh_tt    98963 non-null  object
dtypes: float64(6), object(4)
memory usage: 7.6+ MB

In [6]:
diem_df.columns

Index(['id', 'mssv', ' mamh', ' malop', ' sotc', ' namhoc', ' hocky', ' diem',
       ' trangthai', ' mamh_tt'],
      dtype='object')

In [7]:
diem_df.columns = [
    'id', 'mssv', 'ma_mh', 'ma_lop',
    'so_tc', 'nam_hoc', 'hoc_ky', 'diem',
    'trang_thai', 'ma_mh_tt'
]

In [8]:
diem_df.sample(3)

,id,mssv,ma_mh,ma_lop,so_tc,nam_hoc,hoc_ky,diem,trang_thai,ma_mh_tt
60436,NaN,EC9847A0XPvAibaEXe+xRE5267JUoFjPpkePPDCJ,CE101,CE101.G21.MTCL,4.0,2015.0,2.0,5.1,1.0,NULL)
58463,NaN,F5D9D9A8XPvAibaEXe/Q6C3BndaQUAH+OgLjwe4B,MA005,MA005.G26,3.0,2015.0,2.0,0.6,1.0,NULL)
68014,NaN,23EB5F7FXPvAibaEXe9ej2kTw4OUmgmhgDhxaVMx,SE104,SE104.G24,4.0,2015.0,2.0,7.5,1.0,NULL)

In [9]:
diem_df.drop(['id', 'ma_mh_tt'], axis=1, inplace=True)

In [10]:
diem_df.isnull().all(axis=1).sum()

136

In [11]:
drop_index = diem_df[diem_df.isnull().all(axis=1)].index
diem_df.drop(index=drop_index, inplace=True)

In [12]:
diem_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 98963 entries, 0 to 99098
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   mssv        98963 non-null  object
 1   ma_mh       98963 non-null  object
 2   ma_lop      98963 non-null  object
 3   so_tc       98963 non-null  float64
 4   nam_hoc     98963 non-null  float64
 5   hoc_ky      98963 non-null  float64
 6   diem        98928 non-null  float64
 7   trang_thai  98963 non-null  float64
dtypes: float64(5), object(3)
memory usage: 6.8+ MB

## trang_thai_mien

In [13]:
(
    diem_df.trang_thai == 4 & \
    ~ diem_df.ma_lop.apply(lambda x: str(x).strip().endswith('.M'))
).sum()

55

In [14]:
(
    diem_df.trang_thai == 4 & \
    diem_df.ma_lop.apply(lambda x: str(x).strip().endswith('.M'))
).sum()

55

In [15]:
trang_thai_mien_mask = (
    diem_df.trang_thai == 4 & \
    diem_df.ma_lop.apply(lambda x: str(x).strip().endswith('.M'))
)
drop_index = diem_df[diem_df.diem.isnull() & ~trang_thai_mien_mask].index
drop_index

Index([43438, 87113, 88585, 88691, 88747, 89353, 89537, 89750, 90780, 90830,
       91398, 91444, 91688, 93264, 93326, 93458, 93462, 93471, 94856, 94861,
       96096, 96134, 96340, 96450, 96924, 97245, 97354, 97629, 97939, 98027,
       98088, 98271, 98584, 98924, 99069],
      dtype='int64')

In [16]:
diem_df.drop(index=drop_index, inplace=True)

In [17]:
diem_df.loc[trang_thai_mien_mask, 'diem'] = None

In [18]:
diem_df.drop(['ma_lop', 'trang_thai'], axis=1, inplace=True)

In [19]:
diem_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 98928 entries, 0 to 99098
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   mssv     98928 non-null  object
 1   ma_mh    98928 non-null  object
 2   so_tc    98928 non-null  float64
 3   nam_hoc  98928 non-null  float64
 4   hoc_ky   98928 non-null  float64
 5   diem     98873 non-null  float64
dtypes: float64(4), object(2)
memory usage: 5.3+ MB

## mssv

In [20]:
diem_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'nam_hoc', 'hoc_ky', 'diem'], dtype='object')

In [21]:
diem_df.mssv.dtype

dtype('O')

In [22]:
diem_df.mssv.value_counts(dropna=False)

mssv
8219EA1DXPvAibaEXe/PGAaNNWvbUAwbuGIAPcg8    62
AE2C4867XPvAibaEXe/Lh6v1XxTKJdYKiEjXsiho    59
061A670AXPvAibaEXe9fafwYRU+NpkvJumT/CzS9    59
2C674C46XPvAibaEXe8Y+/3uR2PkTOGNxs8OFvnz    58
E40BE770XPvAibaEXe8wMpKQnQ7j6FCNcAxuNF2I    57
                                            ..
00C64B85XPvAibaEXe/GFbVLDV6SZJlZKXs0/KN4     1
8641CD9BXPvAibaEXe9LZwdMb86KAzf186r0q1ut     1
AE34A424XPvAibaEXe/aPLdUCtOgCv0t/1wT/D3z     1
5EE0C76EXPvAibaEXe9z+h7aUGr+1HVziw3dtd1q     1
2E8DCF6CXPvAibaEXe8z1Io4iT8HJHYVP7dsY6fm     1
Name: count, Length: 4050, dtype: int64

In [23]:
diem_df.mssv.isnull().sum()

0

In [24]:
diem_df.mssv.str.len().value_counts(dropna=False)

mssv
40    98928
Name: count, dtype: int64

In [25]:
diem_df.mssv = diem_df.mssv.str.strip()

In [26]:
diem_df.mssv.str.len().value_counts(dropna=False)

mssv
40    98928
Name: count, dtype: int64

In [27]:
diem_df.mssv.apply(lambda x: 'null' in str(x).lower()).sum()

0

## ma_mh

In [28]:
diem_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'nam_hoc', 'hoc_ky', 'diem'], dtype='object')

In [29]:
diem_df.ma_mh.dtype

dtype('O')

In [30]:
diem_df.ma_mh.value_counts(dropna=False)

ma_mh
 MA001     4775
 MA003     4626
 IT001     4467
 MA002     4424
 PE001     4100
           ...
 NT406        1
 CS5030       1
 ITEM1        1
 NT305        1
 SE323        1
Name: count, Length: 226, dtype: int64

In [31]:
diem_df.ma_mh.str.len().value_counts(dropna=False)

ma_mh
6    95530
9     1164
7     1151
5     1083
Name: count, dtype: int64

In [32]:
diem_df.mssv = diem_df.mssv.str.strip().str.upper()

In [33]:
diem_df.ma_mh.str.len().value_counts(dropna=False)

ma_mh
6    95530
9     1164
7     1151
5     1083
Name: count, dtype: int64

In [34]:
diem_df.ma_mh.isnull().sum()

0

In [35]:
diem_df.mssv.apply(lambda x: 'null' in str(x).lower()).sum()

0

## so_tc

In [36]:
diem_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'nam_hoc', 'hoc_ky', 'diem'], dtype='object')

In [37]:
diem_df.so_tc.dtype

dtype('float64')

In [38]:
diem_df.so_tc.value_counts(dropna=False)

so_tc
4.0    47686
3.0    32155
2.0     8487
0.0     7519
5.0     2618
1.0      463
Name: count, dtype: int64

In [39]:
diem_df.so_tc.isnull().sum()

0

In [40]:
diem_df.so_tc.describe()

count    98928.000000
mean         3.211790
std          1.153947
min          0.000000
25%          3.000000
50%          4.000000
75%          4.000000
max          5.000000
Name: so_tc, dtype: float64

## nam_hoc

In [41]:
diem_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'nam_hoc', 'hoc_ky', 'diem'], dtype='object')

In [42]:
diem_df.nam_hoc.dtype

dtype('float64')

In [43]:
diem_df.nam_hoc.value_counts(dropna=False)

nam_hoc
2015.0    34703
2016.0    25979
2014.0    24820
2013.0    13414
2012.0       12
Name: count, dtype: int64

In [44]:
diem_df.nam_hoc.isnull().sum()

0

In [45]:
diem_df.nam_hoc.describe()

count    98928.000000
mean      2014.740165
std          0.994714
min       2012.000000
25%       2014.000000
50%       2015.000000
75%       2016.000000
max       2016.000000
Name: nam_hoc, dtype: float64

## hoc_ky

In [46]:
diem_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'nam_hoc', 'hoc_ky', 'diem'], dtype='object')

In [47]:
diem_df.hoc_ky.dtype

dtype('float64')

In [48]:
diem_df.hoc_ky.value_counts(dropna=False)

hoc_ky
1.0    58209
2.0    38071
3.0     2648
Name: count, dtype: int64

In [49]:
diem_df.hoc_ky.isnull().sum()

0

In [50]:
diem_df.hoc_ky.describe()

count    98928.000000
mean         1.438369
std          0.547484
min          1.000000
25%          1.000000
50%          1.000000
75%          2.000000
max          3.000000
Name: hoc_ky, dtype: float64

## diem

In [51]:
diem_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'nam_hoc', 'hoc_ky', 'diem'], dtype='object')

In [52]:
diem_df.diem.dtype

dtype('float64')

In [53]:
diem_df.diem.value_counts(dropna=False)

diem
7.5    4966
8.0    4952
7.0    4918
0.0    4759
6.5    4289
       ...
1.3      93
1.9      84
NaN      55
0.4      54
0.1      20
Name: count, Length: 102, dtype: int64

In [54]:
diem_df.diem.isnull().sum()

55

In [55]:
diem_df.diem.describe()

count    98873.000000
mean         6.335444
std          2.379214
min          0.000000
25%          5.300000
50%          6.900000
75%          8.000000
max         10.000000
Name: diem, dtype: float64

In [56]:
diem_df.rename(columns={'diem': 'diem_hp'}, inplace=True)
diem_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'nam_hoc', 'hoc_ky', 'diem_hp'], dtype='object')

## handle duplication so_tc

In [57]:
diem_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 98928 entries, 0 to 99098
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   mssv     98928 non-null  object
 1   ma_mh    98928 non-null  object
 2   so_tc    98928 non-null  float64
 3   nam_hoc  98928 non-null  float64
 4   hoc_ky   98928 non-null  float64
 5   diem_hp  98873 non-null  float64
dtypes: float64(4), object(2)
memory usage: 5.3+ MB

In [58]:
tmp2 = diem_df[['ma_mh', 'so_tc']].drop_duplicates()
tmp1 = tmp2.duplicated(subset=["ma_mh"], keep=False)
tmp3 = tmp2[tmp1].sort_values(by=['ma_mh'])
# print(tmp3.to_markdown())
tmp3

         ma_mh  so_tc
83494    CE103    0.0
18107    CE103    4.0
84080    CE118    0.0
18106    CE118    4.0
67737   CS2433    3.0
...        ...    ...
70176    SE214    4.0
70242    SE214    3.0
24893    SE330    4.0
65178    SE330    3.0
86743    SE330    0.0

[96 rows x 2 columns]

In [59]:
tmp = diem_df
tmp.so_tc = tmp.so_tc.astype('float32')
diem_df['so_tc'] = tmp.groupby('ma_mh')['so_tc'].transform(lambda x: x.mean())

In [60]:
tmp2 = diem_df[['ma_mh', 'so_tc']].drop_duplicates()
tmp1 = tmp2.duplicated(subset=["ma_mh"], keep=False)
tmp3 = tmp2[tmp1].sort_values(by=['ma_mh'])
# print(tmp3.to_markdown())
tmp3

Empty DataFrame
Columns: [ma_mh, so_tc]
Index: []

In [61]:
tmp2 = diem_df[['ma_mh', 'so_tc']].drop_duplicates()
tmp2

           ma_mh     so_tc
0         CS1113  4.000000
1          PH001  2.990592
2       ENGL1113  3.000000
3         ADENG1  0.000000
4          SS001  5.000000
...          ...       ...
92038      CE201  2.000000
92120      CE326  3.000000
94703      CS302  3.000000
98928      IE403  3.000000
99040   MSIS4263  3.000000

[226 rows x 2 columns]

In [62]:
diem_df.so_tc = diem_df.so_tc.astype('int16')

In [63]:
diem_df.describe()

              so_tc       nam_hoc        hoc_ky       diem_hp
count  98928.000000  98928.000000  98928.000000  98873.000000
mean       2.627446   2014.740165      1.438369      6.335444
std        1.012937      0.994714      0.547484      2.379214
min        0.000000   2012.000000      1.000000      0.000000
25%        2.000000   2014.000000      1.000000      5.300000
50%        3.000000   2015.000000      1.000000      6.900000
75%        3.000000   2016.000000      2.000000      8.000000
max        5.000000   2016.000000      3.000000     10.000000

## data_type

In [64]:
diem_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 98928 entries, 0 to 99098
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   mssv     98928 non-null  object
 1   ma_mh    98928 non-null  object
 2   so_tc    98928 non-null  int16
 3   nam_hoc  98928 non-null  float64
 4   hoc_ky   98928 non-null  float64
 5   diem_hp  98873 non-null  float64
dtypes: float64(3), int16(1), object(2)
memory usage: 4.7+ MB

In [65]:
tmp = diem_df.nam_hoc.unique().tolist()
mapping_dict = {a:str(int(a)) for a in tmp}
diem_df.nam_hoc = diem_df.nam_hoc.map(mapping_dict)
mapping_dict

{2012.0: '2012',
 2013.0: '2013',
 2014.0: '2014',
 2015.0: '2015',
 2016.0: '2016'}

In [66]:
tmp = diem_df.hoc_ky.unique().tolist()
mapping_dict = {a:str(int(a)) for a in tmp}
diem_df.hoc_ky = diem_df.hoc_ky.map(mapping_dict)
mapping_dict

{1.0: '1', 2.0: '2', 3.0: '3'}

In [67]:
diem_df.mssv = diem_df.mssv.astype('category')
diem_df.nam_hoc = diem_df.nam_hoc.astype('category')
diem_df.hoc_ky = diem_df.hoc_ky.astype('category')
diem_df.ma_mh = diem_df.ma_mh.astype('category')
diem_df.so_tc = diem_df.so_tc.astype('int16')
diem_df.diem_hp = diem_df.diem_hp.astype('float32')
diem_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 98928 entries, 0 to 99098
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   mssv     98928 non-null  category
 1   ma_mh    98928 non-null  category
 2   so_tc    98928 non-null  int16
 3   nam_hoc  98928 non-null  category
 4   hoc_ky   98928 non-null  category
 5   diem_hp  98873 non-null  float32
dtypes: category(4), float32(1), int16(1)
memory usage: 2.1 MB

# diem_Thu

In [68]:
diem_Thu_df = pd.read_parquet(clean_data_folder/'diem_Thu.parquet')

In [69]:
diem_Thu_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 674072 entries, 0 to 674071
Data columns (total 13 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   mssv        674072 non-null  category
 1   ma_mh       674072 non-null  category
 2   ma_lop      674072 non-null  category
 3   so_tc       674072 non-null  category
 4   hoc_ky      674072 non-null  category
 5   nam_hoc     674072 non-null  category
 6   diem_qt     657936 non-null  float32
 7   diem_th     657936 non-null  float32
 8   diem_gk     657936 non-null  float32
 9   diem_ck     657936 non-null  float32
 10  diem_hp     657936 non-null  float32
 11  trang_thai  674072 non-null  category
 12  tinh_trang  674072 non-null  category
dtypes: category(8), float32(5)
memory usage: 20.9 MB

In [70]:
(
    diem_Thu_df.trang_thai == 4 & \
    ~ diem_Thu_df.ma_lop.apply(lambda x: str(x).strip().endswith('.M'))
).sum()

0

In [71]:
diem_Thu_df.columns

Index(['mssv', 'ma_mh', 'ma_lop', 'so_tc', 'hoc_ky', 'nam_hoc', 'diem_qt',
       'diem_th', 'diem_gk', 'diem_ck', 'diem_hp', 'trang_thai', 'tinh_trang'],
      dtype='object')

In [72]:
diem_Thu_df.drop(
    ['ma_lop', 'diem_qt', 'diem_th', 'diem_gk',
    'diem_ck', 'trang_thai', 'tinh_trang'],
    axis=1, inplace=True
)

In [73]:
diem_Thu_df.so_tc = diem_Thu_df.so_tc.astype('int16')

In [74]:
diem_Thu_df.describe()

               so_tc        diem_hp
count  674072.000000  657936.000000
mean        2.714789       6.548474
std         1.328435       2.395572
min         0.000000       0.000000
25%         2.000000       5.600000
50%         3.000000       7.000000
75%         3.000000       8.200000
max        64.000000      10.000000

In [75]:
diem_Thu_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 674072 entries, 0 to 674071
Data columns (total 6 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     674072 non-null  category
 1   ma_mh    674072 non-null  category
 2   so_tc    674072 non-null  int16
 3   hoc_ky   674072 non-null  category
 4   nam_hoc  674072 non-null  category
 5   diem_hp  657936 non-null  float32
dtypes: category(4), float32(1), int16(1)
memory usage: 8.4 MB

# merge diem_df and diem_Thu_df

In [76]:
diem_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'nam_hoc', 'hoc_ky', 'diem_hp'], dtype='object')

In [77]:
diem_Thu_df.columns

Index(['mssv', 'ma_mh', 'so_tc', 'hoc_ky', 'nam_hoc', 'diem_hp'], dtype='object')

In [78]:
diem_hp_df = pd.merge(
    diem_df, diem_Thu_df,
    on=list(diem_df.columns),
    how='outer'
)
diem_hp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 773000 entries, 0 to 772999
Data columns (total 6 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     773000 non-null  object
 1   ma_mh    773000 non-null  object
 2   so_tc    773000 non-null  int16
 3   nam_hoc  773000 non-null  object
 4   hoc_ky   773000 non-null  category
 5   diem_hp  756809 non-null  float32
dtypes: category(1), float32(1), int16(1), object(3)
memory usage: 22.9+ MB

## handle duplication rows

In [79]:
diem_hp_pkey = ['mssv', 'nam_hoc', 'hoc_ky', 'ma_mh']
diem_hp_df[diem_hp_pkey].duplicated().sum()

51

In [80]:
tmp = diem_hp_df[diem_hp_pkey].duplicated(keep=False)
diem_hp_df[tmp].sort_values(by=diem_hp_pkey)

,mssv,ma_mh,so_tc,nam_hoc,hoc_ky,diem_hp
560330,00CFFDDFXPvAibaEXe9PaZSVcf3BgqtWEBh0HDBi,JAN02,4,2019,2,4.6
581648,00CFFDDFXPvAibaEXe9PaZSVcf3BgqtWEBh0HDBi,JAN02,4,2019,2,3.5
559726,06B78A83XPvAibaEXe+b/3AZFelvL6x33ODd3+Y5,ENGL1213,2,2019,2,2.0
566870,06B78A83XPvAibaEXe+b/3AZFelvL6x33ODd3+Y5,ENGL1213,2,2019,2,6.8
479702,06EEDB7DXPvAibaEXe8E6yzSPpyFOfvrOcCQyyax,ENG02,2,2018,1,4.6
...,...,...,...,...,...,...
566424,F6009921XPvAibaEXe9nP2x7vQNdVRElP3y/nIwA,ENGL1213,2,2019,2,6.0
479730,FA3B3223XPvAibaEXe/glop/3mrWAOZRKBX4avQd,ENG02,2,2018,1,4.9
492996,FA3B3223XPvAibaEXe/glop/3mrWAOZRKBX4avQd,ENG02,2,2018,1,5.9
482895,FF575360XPvAibaEXe9wgACCA7SCWWiaUs/GWfcV,ENG01,2,2018,1,4.3
482954,FF575360XPvAibaEXe9wgACCA7SCWWiaUs/GWfcV,ENG01,2,2018,1,5.9

In [81]:
tmp = diem_hp_df[diem_hp_pkey].duplicated(keep=False)
tmp = diem_hp_df[tmp].index
diem_hp_df.drop(index=tmp, inplace=True)

In [82]:
tmp = diem_hp_df[diem_hp_pkey].duplicated(keep=False)
diem_hp_df[tmp].sort_values(by=diem_hp_pkey)

Empty DataFrame
Columns: [mssv, ma_mh, so_tc, nam_hoc, hoc_ky, diem_hp]
Index: []

In [83]:
diem_hp_df = pd.merge(
    diem_hp_df, diem_df,
    on=list(diem_df.columns),
    how='outer'
)
diem_hp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 772898 entries, 0 to 772897
Data columns (total 6 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     772898 non-null  object
 1   ma_mh    772898 non-null  object
 2   so_tc    772898 non-null  int16
 3   nam_hoc  772898 non-null  object
 4   hoc_ky   772898 non-null  category
 5   diem_hp  756710 non-null  float32
dtypes: category(1), float32(1), int16(1), object(3)
memory usage: 22.9+ MB

In [84]:
tmp = diem_hp_df[diem_hp_pkey].duplicated(keep=False)
diem_hp_df[tmp].sort_values(by=diem_hp_pkey)

Empty DataFrame
Columns: [mssv, ma_mh, so_tc, nam_hoc, hoc_ky, diem_hp]
Index: []

## handle duplication so_tc

In [85]:
tmp2 = diem_hp_df[['ma_mh', 'so_tc']].drop_duplicates()
tmp1 = tmp2.duplicated(subset=["ma_mh"], keep=False)
tmp3 = tmp2[tmp1].sort_values(by=['ma_mh'])
# print(tmp3.to_markdown())
tmp3

Empty DataFrame
Columns: [ma_mh, so_tc]
Index: []

# calculate diem_hk

In [86]:
diem_hp_df.dropna(how='any', inplace=True)
diem_hp_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 756710 entries, 0 to 772897
Data columns (total 6 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     756710 non-null  object
 1   ma_mh    756710 non-null  object
 2   so_tc    756710 non-null  int16
 3   nam_hoc  756710 non-null  object
 4   hoc_ky   756710 non-null  category
 5   diem_hp  756710 non-null  float32
dtypes: category(1), float32(1), int16(1), object(3)
memory usage: 28.1+ MB

In [87]:
diem_hp_df['diem_x_tc'] = diem_hp_df.diem_hp * diem_hp_df.so_tc
diem_hp_df.sample(5)

,mssv,ma_mh,so_tc,nam_hoc,hoc_ky,diem_hp,diem_x_tc
412351,D6FB2161XPvAibaEXe8NoNh54Mn6M9V+6Pt1xCYu,MA005,2,2016,2,7.6,15.2
381287,62A950A6XPvAibaEXe8yzZ/8QUtgdv/TDzLoF+yc,IT006,2,2015,3,3.3,6.6
76103,8EA62CACXPVAIBAEXE/RR9UJZGOYEP5IERX1DCP7,PH001,2,2016,1,5.8,11.6
749010,2A6B1556XPvAibaEXe9j/EZgTdvJATIe3Ooh3WXB,SS006,2,2022,1,2.6,5.2
3653,2CE33A2EXPVAIBAEXE+UDHZQ6I3ZLR6F2C3JS/1U,IT001,3,2013,1,5.0,15.0

In [88]:
dtb_hk_pkey = ['mssv', 'nam_hoc', 'hoc_ky']
dtb_hk_df = diem_hp_df.groupby(dtb_hk_pkey).apply(lambda x: x['diem_x_tc'].sum() / x['so_tc'].sum())

C:\Users\vuhh2\AppData\Local\Temp\ipykernel_9440\3218171244.py:2: RuntimeWarning: invalid value encountered in divide
  dtb_hk_df = diem_hp_df.groupby(dtb_hk_pkey).apply(lambda x: x['diem_x_tc'].sum() / x['so_tc'].sum())

In [89]:
dtb_hk_df.sample(5)

mssv                                      nam_hoc  hoc_ky
04C9CC0EXPVAIBAEXE/S5MCHDNRLM80QIVJ4RYP4  2015     2         7.533334
4B44DB9CXPvAibaEXe+cHxM5cHw4WnfUr5zHt0ak  2017     1         7.725000
484049E2XPvAibaEXe8JyzRlwVelI3aUgX2XX+pg  2022     1         7.676471
E85D6042XPvAibaEXe+F5/cNCOrl8b/YMEsp2Kyo  2017     1         7.894118
6C014AFEXPvAibaEXe/JhqMYLzzrR7PXSTLh//YT  2016     1         6.307692
dtype: float64

In [90]:
dtb_hk_df.info()

<class 'pandas.core.series.Series'>
MultiIndex: 148398 entries, ('0000AC05XPvAibaEXe9B2tolTZ0JLoBGbkQixQS6', '2021', '1') to ('FFFCEDACXPvAibaEXe/r1+Wy29gBaT8F536ZLuBZ', '2009', '1')
Series name: None
Non-Null Count   Dtype
--------------   -----
148132 non-null  float64
dtypes: float64(1)
memory usage: 2.4+ MB

In [91]:
dtb_hk_df = dtb_hk_df.reset_index(name='dtb_hk')
dtb_hk_df.sample(5)

                                            mssv nam_hoc hoc_ky    dtb_hk
74488   8275AFF1XPVAIBAEXE887JOJHK2RV2ODGNV6TIR2    2016      1  7.416667
111633  C27C4BC3XPvAibaEXe+R+jOiVy4LIPWlBbFay3eJ    2013      1  5.781250
139704  F152A73EXPvAibaEXe9Hg4P9GaiGIIDn5D+TYaGh    2013      3  6.900000
144281  F96E9B2DXPvAibaEXe+oshwCJ2TOL7JUu9F576u8    2021      1  8.480000
50803   590263C4XPvAibaEXe9mDsFtgVHJ/lr5wIkYTfyo    2019      1  8.060000

In [92]:
dtb_hk_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148398 entries, 0 to 148397
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     148398 non-null  object
 1   nam_hoc  148398 non-null  object
 2   hoc_ky   148398 non-null  category
 3   dtb_hk   148132 non-null  float64
dtypes: category(1), float64(1), object(2)
memory usage: 3.5+ MB

In [93]:
dtb_hk_df[dtb_hk_df.dtb_hk.isnull()]

                                            mssv nam_hoc hoc_ky  dtb_hk
77      00169126XPvAibaEXe85YhhPviVpreIIM/uxLQ/I    2020      3     NaN
86      0018C59CXPvAibaEXe8C3lblh2dNniH+SYgLosUA    2019      3     NaN
417     00A6F5DAXPvAibaEXe/zT99h3DDtvT/brt/zZ/RZ    2019      3     NaN
526     00C64B85XPVAIBAEXE/GFBVLDV6SZJLZKXS0/KN4    2014      1     NaN
527     00C64B85XPvAibaEXe/GFbVLDV6SZJlZKXs0/KN4    2014      1     NaN
...                                          ...     ...    ...     ...
146603  FCE94F5AXPvAibaEXe/1vWrs0w8t9jOSaSfASfMh    2020      3     NaN
146930  FD72993AXPvAibaEXe+MMervxP1vAKK1MPVOqbY1    2019      3     NaN
147397  FE3AC989XPvAibaEXe8VnqU11737Hl6IFmKBfB+P    2019      3     NaN
147399  FE3AC989XPvAibaEXe8VnqU11737Hl6IFmKBfB+P    2020      2     NaN
148188  FF9F4B4BXPvAibaEXe9hYalhCsDQbZInk2E5ehqz    2019      3     NaN

[266 rows x 4 columns]

In [94]:
diem_hp_df[
    (diem_hp_df.mssv == 'FCE94F5AXPvAibaEXe/1vWrs0w8t9jOSaSfASfMh') & \
    (diem_hp_df.nam_hoc == '2020') & \
    (diem_hp_df.hoc_ky == '3')
]

,mssv,ma_mh,so_tc,nam_hoc,hoc_ky,diem_hp,diem_x_tc
721612,FCE94F5AXPvAibaEXe/1vWrs0w8t9jOSaSfASfMh,CSBU016,0,2020,3,7.8,0.0

# sv_dtb_hk_df

In [95]:
sv_dtb_hk_df = pd.read_parquet(clean_data_folder/'sinhvien_dtb_hocky.parquet')

In [96]:
sv_dtb_hk_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84952 entries, 0 to 84951
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   mssv      84952 non-null  category
 1   hoc_ky    84952 non-null  category
 2   nam_hoc   84952 non-null  category
 3   dtb_hk    84952 non-null  float32
 4   so_tc_hk  84952 non-null  category
dtypes: category(4), float32(1)
memory usage: 1.3 MB

In [97]:
sv_dtb_hk_df.so_tc_hk.astype('int16').describe()

count    84952.000000
mean        16.703350
std          6.305202
min          0.000000
25%         14.000000
50%         18.000000
75%         20.000000
max        195.000000
Name: so_tc_hk, dtype: float64

In [98]:
(sv_dtb_hk_df.so_tc_hk == '0').sum()

967

In [99]:
sv_dtb_hk_df[sv_dtb_hk_df.so_tc_hk == '0']

,mssv,hoc_ky,nam_hoc,dtb_hk,so_tc_hk
76,152920E2XPvAibaEXe8SRUt3BATKgareMyi/MAyS,2,2016,0.0,0
2966,13A871D1XPvAibaEXe92Mw4ZEAxz0xYHHlwVWH2m,2,2017,0.0,0
3595,0B431A01XPvAibaEXe87069oyWO+IS0M6kVzLXKw,2,2016,0.0,0
4391,8F5FEF7AXPvAibaEXe/WTR5UGsYutKVkihRPCmsN,2,2017,0.0,0
7796,33BEFDADXPvAibaEXe+XOEV1VJ5O26vfBUXS7TF7,1,2017,0.0,0
...,...,...,...,...,...
84937,D75F7AF3XPvAibaEXe8UkZVD+5XbrAXdMpZ3BbG7,2,2022,0.0,0
84940,68967370XPvAibaEXe9Zp44TyFcBSDcwWhsGcthJ,2,2022,0.0,0
84949,09DE3A51XPvAibaEXe/GEP39G15BdRSEDU3D3+LV,2,2022,0.0,0
84950,CCF627D0XPvAibaEXe+oAybUv81bbkc8L/mx+IhC,2,2022,0.0,0
84951,A6169055XPvAibaEXe81r7KrCH0uc4QKxDeoWYb4,2,2022,0.0,0

In [100]:
tmp = sv_dtb_hk_df[sv_dtb_hk_df.so_tc_hk == '0'].index
sv_dtb_hk_df.drop(index=tmp, inplace=True)

In [101]:
(sv_dtb_hk_df.so_tc_hk == '0').sum()

0

In [102]:
sv_dtb_hk_df.drop(columns=['so_tc_hk'], inplace=True)

In [103]:
sv_dtb_hk_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 83985 entries, 0 to 84948
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   mssv     83985 non-null  category
 1   hoc_ky   83985 non-null  category
 2   nam_hoc  83985 non-null  category
 3   dtb_hk   83985 non-null  float32
dtypes: category(3), float32(1)
memory usage: 1.9 MB

# merge dtb_hk_df and sv_dtb_hk_df

In [104]:
dtb_hk_pkey

['mssv', 'nam_hoc', 'hoc_ky']

In [105]:
dtb_hk_df.columns

Index(['mssv', 'nam_hoc', 'hoc_ky', 'dtb_hk'], dtype='object')

In [106]:
sv_dtb_hk_df.columns

Index(['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk'], dtype='object')

In [107]:
enriched_dtb_hk_df = pd.merge(
    sv_dtb_hk_df, dtb_hk_df,
    on=list(dtb_hk_df.columns),
    how='outer'
)

In [108]:
enriched_dtb_hk_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227058 entries, 0 to 227057
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     227058 non-null  object
 1   hoc_ky   227058 non-null  category
 2   nam_hoc  227058 non-null  object
 3   dtb_hk   226792 non-null  float64
dtypes: category(1), float64(1), object(2)
memory usage: 5.4+ MB

## handle duplication rows

In [109]:
enriched_dtb_hk_df[dtb_hk_pkey].duplicated().sum()

78652

In [110]:
tmp = enriched_dtb_hk_df[dtb_hk_pkey].duplicated(keep=False)
enriched_dtb_hk_df[tmp].sort_values(by=dtb_hk_pkey)

                                            mssv hoc_ky nam_hoc    dtb_hk
69884   0000AC05XPvAibaEXe9B2tolTZ0JLoBGbkQixQS6      1    2021  7.790000
83985   0000AC05XPvAibaEXe9B2tolTZ0JLoBGbkQixQS6      1    2021  7.807692
72067   0000AC05XPvAibaEXe9B2tolTZ0JLoBGbkQixQS6      2    2021  8.280000
83986   0000AC05XPvAibaEXe9B2tolTZ0JLoBGbkQixQS6      2    2021  8.275000
74645   0000AC05XPvAibaEXe9B2tolTZ0JLoBGbkQixQS6      1    2022  7.560000
...                                          ...    ...     ...       ...
227048  FFFA4234XPvAibaEXe+OhmjSj4XEzdTGgcTdT9fT      2    2018  8.447058
31922   FFFA4234XPvAibaEXe+OhmjSj4XEzdTGgcTdT9fT      1    2019  7.250000
227049  FFFA4234XPvAibaEXe+OhmjSj4XEzdTGgcTdT9fT      1    2019  7.211766
39729   FFFA4234XPvAibaEXe+OhmjSj4XEzdTGgcTdT9fT      2    2019  8.100000
227050  FFFA4234XPvAibaEXe+OhmjSj4XEzdTGgcTdT9fT      2    2019  8.100000

[157304 rows x 4 columns]

In [111]:
tmp = enriched_dtb_hk_df[dtb_hk_pkey].duplicated(keep=False)
tmp = enriched_dtb_hk_df[tmp].index
enriched_dtb_hk_df.drop(index=tmp, inplace=True)

In [112]:
tmp = enriched_dtb_hk_df[dtb_hk_pkey].duplicated(keep=False)
enriched_dtb_hk_df[tmp].sort_values(by=dtb_hk_pkey)

Empty DataFrame
Columns: [mssv, hoc_ky, nam_hoc, dtb_hk]
Index: []

In [113]:
enriched_dtb_hk_df = pd.merge(
    enriched_dtb_hk_df, dtb_hk_df,
    on=list(dtb_hk_df.columns),
    how='outer'
)
enriched_dtb_hk_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148406 entries, 0 to 148405
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     148406 non-null  object
 1   hoc_ky   148406 non-null  category
 2   nam_hoc  148406 non-null  object
 3   dtb_hk   148140 non-null  float64
dtypes: category(1), float64(1), object(2)
memory usage: 3.5+ MB

In [114]:
tmp = enriched_dtb_hk_df[dtb_hk_pkey].duplicated(keep=False)
enriched_dtb_hk_df[tmp].sort_values(by=dtb_hk_pkey)

Empty DataFrame
Columns: [mssv, hoc_ky, nam_hoc, dtb_hk]
Index: []

# data_type

In [115]:
enriched_dtb_hk_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148406 entries, 0 to 148405
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     148406 non-null  object
 1   hoc_ky   148406 non-null  category
 2   nam_hoc  148406 non-null  object
 3   dtb_hk   148140 non-null  float64
dtypes: category(1), float64(1), object(2)
memory usage: 3.5+ MB

In [116]:
tmp = enriched_dtb_hk_df.nam_hoc.unique().tolist()
mapping_dict = {a:str(int(a)) for a in tmp}
enriched_dtb_hk_df.nam_hoc = enriched_dtb_hk_df.nam_hoc.map(mapping_dict)
mapping_dict

{'2018': '2018',
 '2017': '2017',
 '2016': '2016',
 '2015': '2015',
 '2014': '2014',
 '2019': '2019',
 '2020': '2020',
 '2013': '2013',
 '2021': '2021',
 '2022': '2022',
 '2007': '2007',
 '2008': '2008',
 '2009': '2009',
 '2010': '2010',
 '2011': '2011',
 '2012': '2012',
 '2006': '2006'}

In [117]:
tmp = enriched_dtb_hk_df.hoc_ky.unique().tolist()
mapping_dict = {a:str(int(a)) for a in tmp}
enriched_dtb_hk_df.hoc_ky = enriched_dtb_hk_df.hoc_ky.map(mapping_dict)
mapping_dict

{'1': '1', '3': '3', '2': '2'}

In [118]:
enriched_dtb_hk_df.mssv = enriched_dtb_hk_df.mssv.astype('category')
enriched_dtb_hk_df.nam_hoc = enriched_dtb_hk_df.nam_hoc.astype('category')
enriched_dtb_hk_df.hoc_ky = enriched_dtb_hk_df.hoc_ky.astype('category')
enriched_dtb_hk_df.dtb_hk = enriched_dtb_hk_df.dtb_hk.astype('float32')
enriched_dtb_hk_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148406 entries, 0 to 148405
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     148406 non-null  category
 1   hoc_ky   148406 non-null  category
 2   nam_hoc  148406 non-null  category
 3   dtb_hk   148140 non-null  float32
dtypes: category(3), float32(1)
memory usage: 1.8 MB

# final check

In [119]:
enriched_dtb_hk_df[enriched_dtb_hk_df.isnull().any(axis=1)]

                                            mssv hoc_ky nam_hoc  dtb_hk
5371    00169126XPvAibaEXe85YhhPviVpreIIM/uxLQ/I      3    2020     NaN
5378    0018C59CXPvAibaEXe8C3lblh2dNniH+SYgLosUA      3    2019     NaN
5508    00A6F5DAXPvAibaEXe/zT99h3DDtvT/brt/zZ/RZ      3    2019     NaN
5536    00C64B85XPVAIBAEXE/GFBVLDV6SZJLZKXS0/KN4      1    2014     NaN
5537    00C64B85XPvAibaEXe/GFbVLDV6SZJlZKXs0/KN4      1    2014     NaN
...                                          ...    ...     ...     ...
69656   FF9F4B4BXPvAibaEXe9hYalhCsDQbZInk2E5ehqz      3    2019     NaN
94484   5224906BXPvAibaEXe/M+/uAwVeHhHk9cAteZsrT      2    2021     NaN
119538  A406E7FDXPvAibaEXe/XBbLEWRhgQYQrAzwms21C      2    2017     NaN
129831  C57E7F21XPvAibaEXe8VekUw4ELehuWMmX7vpi8O      2    2017     NaN
146126  F934AFD4XPvAibaEXe/7YVAxOsMwOmFzQTm7dOKr      2    2020     NaN

[266 rows x 4 columns]

In [120]:
enriched_dtb_hk_df.duplicated().sum()

0

In [121]:
enriched_dtb_hk_df[dtb_hk_pkey].duplicated().sum()

0

In [122]:
enriched_dtb_hk_df.describe()

              dtb_hk
count  148140.000000
mean        6.400123
std         2.098026
min         0.000000
25%         5.576923
50%         6.909091
75%         7.857143
max        10.000000

In [123]:
enriched_dtb_hk_df.columns

Index(['mssv', 'hoc_ky', 'nam_hoc', 'dtb_hk'], dtype='object')

In [124]:
enriched_dtb_hk_df.mssv.value_counts(dropna=False)

mssv
611A9B40XPvAibaEXe9N1zCEN2FQqC4gAu9nCd8C    27
5C17AB96XPvAibaEXe+s7fQX5t7T+lWzMsm/jUYl    26
B02A7D33XPvAibaEXe8Yz5YviIhrt11OHzPrKUlM    25
BE8C176EXPvAibaEXe9qFVjW5nX81srQXN/SmJ8s    25
1FF62B8CXPvAibaEXe/U/4p31JRvs5X2iSimqRky    24
                                            ..
5B74541DXPvAibaEXe+2YLpfHiKTIKdRgC4F6npZ     1
1F6AD9BBXPvAibaEXe9SS1kaXnboZq6bVgmj6jrT     1
E1F7BA71XPvAibaEXe88h1TS/CM+BuMw9e+m1QiX     1
E1F9F646XPVAIBAEXE+UDHZQ6I3ZLT1FBP9YP5CR     1
C0B3EB52XPvAibaEXe8Dk1djakWGqMJjZy0ex3w1     1
Name: count, Length: 21930, dtype: int64

In [125]:
enriched_dtb_hk_df.hoc_ky.value_counts(dropna=False)

hoc_ky
1    74016
2    59890
3    14500
Name: count, dtype: int64

In [126]:
enriched_dtb_hk_df.nam_hoc.value_counts(dropna=False)

nam_hoc
2016    15285
2015    15188
2021    13850
2014    12718
2020    12518
2019    11059
2013    10442
2018    10275
2017     9357
2012     7432
2022     7412
2011     6963
2010     5982
2009     4644
2008     3191
2007     1666
2006      424
Name: count, dtype: int64

In [127]:
enriched_dtb_hk_df.dtb_hk.value_counts(dropna=False)

dtb_hk
0.000000    4063
7.000000    1261
8.000000    1201
7.500000    1059
6.500000    1037
            ...
7.626667       1
8.505883       1
7.268749       1
5.328571       1
7.707143       1
Name: count, Length: 18855, dtype: int64

# save

In [128]:
output_path = clean_data_folder/f"enriched_dtb_hk.parquet"
enriched_dtb_hk_df.to_parquet(output_path, index=False)
haha_df = pd.read_parquet(output_path)

In [129]:
haha_df[haha_df.isnull().any(axis=1)]

                                            mssv hoc_ky nam_hoc  dtb_hk
5371    00169126XPvAibaEXe85YhhPviVpreIIM/uxLQ/I      3    2020     NaN
5378    0018C59CXPvAibaEXe8C3lblh2dNniH+SYgLosUA      3    2019     NaN
5508    00A6F5DAXPvAibaEXe/zT99h3DDtvT/brt/zZ/RZ      3    2019     NaN
5536    00C64B85XPVAIBAEXE/GFBVLDV6SZJLZKXS0/KN4      1    2014     NaN
5537    00C64B85XPvAibaEXe/GFbVLDV6SZJlZKXs0/KN4      1    2014     NaN
...                                          ...    ...     ...     ...
69656   FF9F4B4BXPvAibaEXe9hYalhCsDQbZInk2E5ehqz      3    2019     NaN
94484   5224906BXPvAibaEXe/M+/uAwVeHhHk9cAteZsrT      2    2021     NaN
119538  A406E7FDXPvAibaEXe/XBbLEWRhgQYQrAzwms21C      2    2017     NaN
129831  C57E7F21XPvAibaEXe8VekUw4ELehuWMmX7vpi8O      2    2017     NaN
146126  F934AFD4XPvAibaEXe/7YVAxOsMwOmFzQTm7dOKr      2    2020     NaN

[266 rows x 4 columns]

In [130]:
haha_df[dtb_hk_pkey].duplicated().sum()

0

In [131]:
haha_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148406 entries, 0 to 148405
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   mssv     148406 non-null  category
 1   hoc_ky   148406 non-null  category
 2   nam_hoc  148406 non-null  category
 3   dtb_hk   148140 non-null  float32
dtypes: category(3), float32(1)
memory usage: 1.8 MB

In [132]:
haha_df.describe()

              dtb_hk
count  148140.000000
mean        6.400123
std         2.098026
min         0.000000
25%         5.576923
50%         6.909091
75%         7.857143
max        10.000000

In [133]:
haha_df.sample(10)

                                            mssv hoc_ky nam_hoc    dtb_hk
94978   53BABCB4XPvAibaEXe+5f3nhbX2eh3E+k8+0vrzk      1    2015  6.042857
68725   FB94C057XPvAibaEXe8Avt3d+ZAqYDn5m6vnpwWn      3    2012  8.000000
42413   95D98A06XPvAibaEXe85Kg8gbEhwb0hYxxDsaXBe      3    2016  0.000000
112741  8DA684D2XPvAibaEXe8zBeLfIMmoBKdZoQPMioeR      1    2016  5.415385
81226   26BA2C03XPvAibaEXe+Y0lGmaTa/AO+2ehaTjeTz      1    2016  8.407692
43828   9B498412XPVAIBAEXE/XOPUZJJLEGJ07OJR+RTZ/      2    2015  4.646667
54612   C5925E34XPvAibaEXe9aO86Za47HuXSQXHliANAa      1    2012  8.175000
16563   2D17AA04XPvAibaEXe9mv02dd1fbUxFjQ5dfGy23      2    2013  7.437500
49739   B30D0F50XPVAIBAEXE+GSTDVGY5PDOLU7T2WKLIW      1    2014  6.153846
38291   85F05408XPvAibaEXe9KkwUxiQiZ0kPjboSr5z+L      2    2012  3.807692

In [134]:
os.listdir(clean_data_folder)

['12.baoluu.parquet',
 'diem_Thu.parquet',
 'sinhvien_dtb_toankhoa.parquet',
 'uit_hocphi_miengiam.parquet',
 'diemrl.parquet',
 'sinhvien_dtb_hocky.parquet',
 'desktop.ini',
 '14.totnghiep.parquet',
 '1.sinhvien.xlsx',
 '2.diem.xlsx',
 '3.sinhvien_chungchi.xlsx',
 '4.xeploaiav.xlsx',
 '5.Thisinh.xlsx',
 '6.giayxacnhan.xlsx',
 '8.XLHV.xlsx',
 '10.diemrl.xlsx',
 'enriched_dtb_hk.parquet',
 'desktop.ini']